---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyElectricalMaintainAnnotationOrientation
source: html/bd83e2ed-b64a-15d0-026f-5660a081947f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyElectricalMaintainAnnotationOrientation Property

"Maintain Annotation Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyElectricalMaintainAnnotationOrientation { get; }
```